//Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом
//Console.WriteLine("введите пятизначное число");
        //    string num = Console.ReadLine();
       //     string rev = string.Concat(num.Reverse());
       //     Console.WriteLine(num == rev ? "палиндром" : "не палиндром");

//
